# CanSetValue Method (Int32)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ColorFillSchemeEntry..::..CanSetValue Method (Int32)
ColorFillSchemeEntry Class See Also
---
Checks whether StorageType of entry is Integer.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public bool CanSetValue(
	int value
)
```

Visual Basic
---
```text
Public Function CanSetValue ( _
	value As Integer _
) As Boolean
```

Visual C++
---
```text
public:
bool CanSetValue(
	int value
)
```

# ### Parameters
value
    Type: System..::..Int32 New Integer value.
# ### Return Value
True if StorageType of the entry is Integer, false otherwise.
# See Also
ColorFillSchemeEntry Class
CanSetValue Overload
Autodesk.Revit.DB Namespace